# Напишите программу, которая считывает строку-разделитель и три строки,
# а затем выводит указанные строки через разделитель.

a=input()
b=input()
c=input()
d=input()
print(b, c, d, sep= a)
