# Напишите программу, вычисляющую объём куба и площадь его полной поверхности, по введённому значению длины ребра.

a = int(input())
V = a*a*a
S = 6*a*a
print('Объем =', V)
print('Площадь полной поверхности =', S)

