# Напишите программу, которая считывает целое число,
#  после чего на экран выводится следующее и предыдущее целое число с пояснительным текстом.

score = int(input())
print('Следующее за числом', score, 'число:', score  + 1)
print('Для числа', score, 'предыдущее число:', score - 1)




