# Напишите программу, которая считывает три строки по очереди,
# а затем выводит их в обратной последовательности, каждую на отдельной строчке.

a = input()
b = input()
c = input()
print(c)
print(b)
print(a)
